Newfile

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:crfpSP="http://com/rbsg/soa/C040PaymentManagement/CustomerRetrievalForPayment/V01/ServiceParameters/V01/">
   <soapenv:Header/>
   <soapenv:Body>
      <crfpSP:retrievePrimaryCustomerForArr>
         <requestHeader>
            <operatingBrand>NWB</operatingBrand>
            <requestIds>
               <systemId>RequestID</systemId>
               <transactionId>123456789</transactionId>
            </requestIds>
            <cmdType>Request</cmdType>
         </requestHeader>
         <processingParameter>
            <objectReference>
               <identifier>NWB</identifier>
               <context>
                  <schemeName>OrganizationEnterpriseIdType</schemeName>
                  <codeValue>OperatingBrandIdentifier</codeValue>
               </context>
            </objectReference>
         </processingParameter>
         <arrangementIdentifier>
            <identifier>600001457620742222</identifier>
            <context>
               <schemeName>ArrangementEnterpriseIdType</schemeName>
               <codeValue>UKBasicBankAccountNumber</codeValue>
               <description>Some Description</description>
            </context>
            <description>Some Description</description>
         </arrangementIdentifier>
      </crfpSP:retrievePrimaryCustomerForArr>
   </soapenv:Body>
</soapenv:Envelope>
